# DBeam_SetRShutDepth

```pascal
PROCEDURE DBeam_SetRShutDepth(depth : INTEGER);
```

```python
def vs.DBeam_SetRShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER|   |

## Examples
```pascal
DBeam_SetRShutDepth(1);
```
```python
import vs

depth = 1

vs.DBeam_SetRShutDepth(depth)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight